In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [10]:
conector = create_engine('mysql://root:''@localhost/student').connect()

In [11]:
df = pd.read_sql_table('students', conector)

In [12]:
df.head()

   ID   Name   Birthday      Address
0   1  Trang 2000-01-01  Hồ Chí Minh
1   2  Quỳnh 1999-05-10      Cần Thơ
2   3   Long 2002-09-12       Hà Nội
3   4    Lâm 2001-08-02    Bắc Giang
4   5   Hằng 2002-12-12     Hưng Yên